print('Задача 3. Гистограмма частоты')
# Лингвистам необходимо собрать данные о частоте букв в тексте, исходя из этих данных будет строиться гистограмма частоты букв
# Напишите программу, которая получает сам текст и считает, сколько раз в строке встречается каждый символ. На экран нужно 
# вывести содержимое в виде таблицы, отсортированное по алфавиту, а также максимальное значение частоты.  

import example_from_the_task_1

# Это я уже дублировал, давай потом, через недельку еще раз напиши эту программу